RT-Thread/rt-thread/bsp/renesas/ra8m1-ek/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA8M1AH.h
        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR77_b;
    };

    union
    {
        __IOM uint8_t VBTBKR78;        /*!< (@ 0x00000D4E) VBATT Backup Register 78                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR78_b;
    };

    union
    {
        __IOM uint8_t VBTBKR79;        /*!< (@ 0x00000D4F) VBATT Backup Register 79                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR79_b;
    };

    union
    {
        __IOM uint8_t VBTBKR80;        /*!< (@ 0x00000D50) VBATT Backup Register 80                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR80_b;
    };

    union
    {
        __IOM uint8_t VBTBKR81;        /*!< (@ 0x00000D51) VBATT Backup Register 81                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR81_b;
    };

    union
    {
        __IOM uint8_t VBTBKR82;        /*!< (@ 0x00000D52) VBATT Backup Register 82                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR82_b;
    };

    union
    {
        __IOM uint8_t VBTBKR83;        /*!< (@ 0x00000D53) VBATT Backup Register 83                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR83_b;
    };

    union
    {
        __IOM uint8_t VBTBKR84;        /*!< (@ 0x00000D54) VBATT Backup Register 84                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR84_b;
    };

    union
    {
        __IOM uint8_t VBTBKR85;        /*!< (@ 0x00000D55) VBATT Backup Register 85                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR85_b;
    };

    union
    {
        __IOM uint8_t VBTBKR86;        /*!< (@ 0x00000D56) VBATT Backup Register 86                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR86_b;
    };

    union
    {
        __IOM uint8_t VBTBKR87;        /*!< (@ 0x00000D57) VBATT Backup Register 87                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR87_b;
    };

    union
    {
        __IOM uint8_t VBTBKR88;        /*!< (@ 0x00000D58) VBATT Backup Register 88                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR88_b;
    };

    union
    {
        __IOM uint8_t VBTBKR89;        /*!< (@ 0x00000D59) VBATT Backup Register 89                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR89_b;
    };

    union
    {
        __IOM uint8_t VBTBKR90;        /*!< (@ 0x00000D5A) VBATT Backup Register 90                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR90_b;
    };

    union
    {
        __IOM uint8_t VBTBKR91;        /*!< (@ 0x00000D5B) VBATT Backup Register 91                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR91_b;
    };

    union
    {
        __IOM uint8_t VBTBKR92;        /*!< (@ 0x00000D5C) VBATT Backup Register 92                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR92_b;
    };

    union
    {
        __IOM uint8_t VBTBKR93;        /*!< (@ 0x00000D5D) VBATT Backup Register 93                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR93_b;
    };

    union
    {
        __IOM uint8_t VBTBKR94;        /*!< (@ 0x00000D5E) VBATT Backup Register 94                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR94_b;
    };

    union
    {
        __IOM uint8_t VBTBKR95;        /*!< (@ 0x00000D5F) VBATT Backup Register 95                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR95_b;
    };

    union
    {
        __IOM uint8_t VBTBKR96;        /*!< (@ 0x00000D60) VBATT Backup Register 96                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR96_b;
    };

    union
    {
        __IOM uint8_t VBTBKR97;        /*!< (@ 0x00000D61) VBATT Backup Register 97                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR97_b;
    };

    union
    {
        __IOM uint8_t VBTBKR98;        /*!< (@ 0x00000D62) VBATT Backup Register 98                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR98_b;
    };

    union
    {
        __IOM uint8_t VBTBKR99;        /*!< (@ 0x00000D63) VBATT Backup Register 99                                   */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR99_b;
    };

    union
    {
        __IOM uint8_t VBTBKR100;       /*!< (@ 0x00000D64) VBATT Backup Register 100                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR100_b;
    };

    union
    {
        __IOM uint8_t VBTBKR101;       /*!< (@ 0x00000D65) VBATT Backup Register 101                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR101_b;
    };

    union
    {
        __IOM uint8_t VBTBKR102;       /*!< (@ 0x00000D66) VBATT Backup Register 102                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR102_b;
    };

    union
    {
        __IOM uint8_t VBTBKR103;       /*!< (@ 0x00000D67) VBATT Backup Register 103                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR103_b;
    };

    union
    {
        __IOM uint8_t VBTBKR104;       /*!< (@ 0x00000D68) VBATT Backup Register 104                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR104_b;
    };

    union
    {
        __IOM uint8_t VBTBKR105;       /*!< (@ 0x00000D69) VBATT Backup Register 105                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR105_b;
    };

    union
    {
        __IOM uint8_t VBTBKR106;       /*!< (@ 0x00000D6A) VBATT Backup Register 106                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR106_b;
    };

    union
    {
        __IOM uint8_t VBTBKR107;       /*!< (@ 0x00000D6B) VBATT Backup Register 107                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR107_b;
    };

    union
    {
        __IOM uint8_t VBTBKR108;       /*!< (@ 0x00000D6C) VBATT Backup Register 108                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR108_b;
    };

    union
    {
        __IOM uint8_t VBTBKR109;       /*!< (@ 0x00000D6D) VBATT Backup Register 109                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR109_b;
    };

    union
    {
        __IOM uint8_t VBTBKR110;       /*!< (@ 0x00000D6E) VBATT Backup Register 110                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR110_b;
    };

    union
    {
        __IOM uint8_t VBTBKR111;       /*!< (@ 0x00000D6F) VBATT Backup Register 111                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR111_b;
    };

    union
    {
        __IOM uint8_t VBTBKR112;       /*!< (@ 0x00000D70) VBATT Backup Register 112                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR112_b;
    };

    union
    {
        __IOM uint8_t VBTBKR113;       /*!< (@ 0x00000D71) VBATT Backup Register 113                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR113_b;
    };

    union
    {
        __IOM uint8_t VBTBKR114;       /*!< (@ 0x00000D72) VBATT Backup Register 114                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR114_b;
    };

    union
    {
        __IOM uint8_t VBTBKR115;       /*!< (@ 0x00000D73) VBATT Backup Register 115                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR115_b;
    };

    union
    {
        __IOM uint8_t VBTBKR116;       /*!< (@ 0x00000D74) VBATT Backup Register 116                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR116_b;
    };

    union
    {
        __IOM uint8_t VBTBKR117;       /*!< (@ 0x00000D75) VBATT Backup Register 117                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR117_b;
    };

    union
    {
        __IOM uint8_t VBTBKR118;       /*!< (@ 0x00000D76) VBATT Backup Register 118                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR118_b;
    };

    union
    {
        __IOM uint8_t VBTBKR119;       /*!< (@ 0x00000D77) VBATT Backup Register 119                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR119_b;
    };

    union
    {
        __IOM uint8_t VBTBKR120;       /*!< (@ 0x00000D78) VBATT Backup Register 120                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR120_b;
    };

    union
    {
        __IOM uint8_t VBTBKR121;       /*!< (@ 0x00000D79) VBATT Backup Register 121                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR121_b;
    };

    union
    {
        __IOM uint8_t VBTBKR122;       /*!< (@ 0x00000D7A) VBATT Backup Register 122                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR122_b;
    };

    union
    {
        __IOM uint8_t VBTBKR123;       /*!< (@ 0x00000D7B) VBATT Backup Register 123                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR123_b;
    };

    union
    {
        __IOM uint8_t VBTBKR124;       /*!< (@ 0x00000D7C) VBATT Backup Register 124                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR124_b;
    };

    union
    {
        __IOM uint8_t VBTBKR125;       /*!< (@ 0x00000D7D) VBATT Backup Register 125                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR125_b;
    };

    union
    {
        __IOM uint8_t VBTBKR126;       /*!< (@ 0x00000D7E) VBATT Backup Register 126                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR126_b;
    };

    union
    {
        __IOM uint8_t VBTBKR127;       /*!< (@ 0x00000D7F) VBATT Backup Register 127                                  */

        struct
        {
            __IOM uint8_t VBTBKR : 8;  /*!< [7..0] VBTBKRn [7:0] (n=0 to 127)                                         */
        } VBTBKR127_b;
    };
} R_SYSTEM_Type;                       /*!< Size = 3456 (0xd80)                                                       */

/* =========================================================================================================================== */
/* ================                                         R_TSN_CAL                                         ================ */
/* =========================================================================================================================== */

/**
 * @brief Temperature Sensor (R_TSN_CAL)
 */

typedef struct                         /*!< (@ 0x4011B17C) R_TSN_CAL Structure                                        */
{
    union
    {
        __IM uint32_t TSCDR;           /*!< (@ 0x00000000) Temperature Sensor 32 bit Calibration Data Register        */

        struct
        {
            __IM uint32_t TSCDR : 32;  /*!< [31..0] The 32 bit TSCDR register stores temperature sensor
                                        *   calibration converted value.                                              */
        } TSCDR_b;
    };
} R_TSN_CAL_Type;                      /*!< Size = 4 (0x4)                                                            */

/* =========================================================================================================================== */
/* ================                                        R_TSN_CTRL                                         ================ */
/* =========================================================================================================================== */

/**
 * @brief Temperature Sensor (R_TSN_CTRL)
 */

typedef struct                         /*!< (@ 0x40235000) R_TSN_CTRL Structure                                       */
{
    union
    {
        __IOM uint8_t TSCR;            /*!< (@ 0x00000000) Temperature Sensor Control Register                        */

        struct
        {
            uint8_t            : 4;
            __IOM uint8_t TSOE : 1;    /*!< [4..4] Temperature Sensor Enable                                          */
            uint8_t            : 2;
            __IOM uint8_t TSEN : 1;    /*!< [7..7] Temperature Sensor Output Enable                                   */
        } TSCR_b;
    };
} R_TSN_CTRL_Type;                     /*!< Size = 1 (0x1)                                                            */

/* =========================================================================================================================== */
/* ================                                         R_USB_FS0                                         ================ */
/* =========================================================================================================================== */

/**
 * @brief USB 2.0 Module (R_USB_FS0)
 */

typedef struct                         /*!< (@ 0x40250000) R_USB_FS0 Structure                                        */
{
    union
    {
        __IOM uint16_t SYSCFG;         /*!< (@ 0x00000000) System Configuration Control Register                      */

        struct
        {
            __IOM uint16_t USBE  : 1;  /*!< [0..0] USB Operation Enable                                               */
            uint16_t             : 2;
            __IOM uint16_t DMRPU : 1;  /*!< [3..3] D- Line Resistor Control                                           */
            __IOM uint16_t DPRPU : 1;  /*!< [4..4] D+ Line Resistor Control                                           */
            __IOM uint16_t DRPD  : 1;  /*!< [5..5] D+/D- Line Resistor Control                                        */
            __IOM uint16_t DCFM  : 1;  /*!< [6..6] Controller Function Select                                         */
            uint16_t             : 1;
            __IOM uint16_t CNEN  : 1;  /*!< [8..8] CNEN Single End Receiver Enable                                    */
            uint16_t             : 1;
            __IOM uint16_t SCKE  : 1;  /*!< [10..10] USB Clock Enable                                                 */
            uint16_t             : 5;
        } SYSCFG_b;
    };

    union
    {
        __IOM uint16_t BUSWAIT;        /*!< (@ 0x00000002) CPU Bus Wait Register                                      */

        struct
        {
            __IOM uint16_t BWAIT : 4;  /*!< [3..0] CPU Bus Access Wait Specification BWAIT waits (BWAIT+2
                                        *   access cycles)                                                            */
            uint16_t : 12;
        } BUSWAIT_b;
    };

    union
    {
        __IM uint16_t SYSSTS0;         /*!< (@ 0x00000004) System Configuration Status Register 0                     */

        struct
        {
            __IM uint16_t LNST  : 2;   /*!< [1..0] USB Data Line Status Monitor                                       */
            __IM uint16_t IDMON : 1;   /*!< [2..2] External ID0 Input Pin Monitor                                     */
            uint16_t            : 2;
            __IM uint16_t SOFEA : 1;   /*!< [5..5] SOF Active Monitor While Host Controller Function is
                                        *   Selected.                                                                 */
            __IM uint16_t HTACT  : 1;  /*!< [6..6] USB Host Sequencer Status Monitor                                  */
            uint16_t             : 7;
            __IM uint16_t OVCMON : 2;  /*!< [15..14] External USB0_OVRCURA/ USB0_OVRCURB Input Pin MonitorThe
                                        *   OCVMON[1] bit indicates the status of the USBHS_OVRCURA
                                        *   pin. The OCVMON[0] bit indicates the status of the USBHS_OVRCURB
                                        *   pin.                                                                      */
        } SYSSTS0_b;
    };

    union
    {
        __IM uint16_t PLLSTA;          /*!< (@ 0x00000006) PLL Status Register                                        */

        struct
        {
            __IM uint16_t PLLLOCK : 1; /*!< [0..0] PLL Lock Flag                                                      */
            uint16_t              : 15;
        } PLLSTA_b;
    };

    union
    {
        __IOM uint16_t DVSTCTR0;        /*!< (@ 0x00000008) Device State Control Register 0                            */

