RT-Thread/rt-thread/bsp/renesas/ra8m1-ek/ra/fsp/src/bsp/cmsis/Device/RENESAS/Include/R7FA8M1AH.h
 #define R_SYSTEM_VBTICTLR2_VCH0EG_Msk           (0x10UL)       /*!< VCH0EG (Bitfield-Mask: 0x01)                          */
 #define R_SYSTEM_VBTICTLR2_VCH1EG_Pos           (5UL)          /*!< VCH1EG (Bit 5)                                        */
 #define R_SYSTEM_VBTICTLR2_VCH1EG_Msk           (0x20UL)       /*!< VCH1EG (Bitfield-Mask: 0x01)                          */
 #define R_SYSTEM_VBTICTLR2_VCH2EG_Pos           (6UL)          /*!< VCH2EG (Bit 6)                                        */
 #define R_SYSTEM_VBTICTLR2_VCH2EG_Msk           (0x40UL)       /*!< VCH2EG (Bitfield-Mask: 0x01)                          */
/* =======================================================  VBTIMONR  ======================================================== */
 #define R_SYSTEM_VBTIMONR_VCH0MON_Pos           (0UL)          /*!< VCH0MON (Bit 0)                                       */
 #define R_SYSTEM_VBTIMONR_VCH0MON_Msk           (0x1UL)        /*!< VCH0MON (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_VBTIMONR_VCH1MON_Pos           (1UL)          /*!< VCH1MON (Bit 1)                                       */
 #define R_SYSTEM_VBTIMONR_VCH1MON_Msk           (0x2UL)        /*!< VCH1MON (Bitfield-Mask: 0x01)                         */
 #define R_SYSTEM_VBTIMONR_VCH2MON_Pos           (2UL)          /*!< VCH2MON (Bit 2)                                       */
 #define R_SYSTEM_VBTIMONR_VCH2MON_Msk           (0x4UL)        /*!< VCH2MON (Bitfield-Mask: 0x01)                         */
/* ========================================================  VBTBKR0  ======================================================== */
 #define R_SYSTEM_VBTBKR0_VBTBKR_Pos             (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR0_VBTBKR_Msk             (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* ========================================================  VBTBKR1  ======================================================== */
 #define R_SYSTEM_VBTBKR1_VBTBKR_Pos             (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR1_VBTBKR_Msk             (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* ========================================================  VBTBKR2  ======================================================== */
 #define R_SYSTEM_VBTBKR2_VBTBKR_Pos             (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR2_VBTBKR_Msk             (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* ========================================================  VBTBKR3  ======================================================== */
 #define R_SYSTEM_VBTBKR3_VBTBKR_Pos             (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR3_VBTBKR_Msk             (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* ========================================================  VBTBKR4  ======================================================== */
 #define R_SYSTEM_VBTBKR4_VBTBKR_Pos             (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR4_VBTBKR_Msk             (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* ========================================================  VBTBKR5  ======================================================== */
 #define R_SYSTEM_VBTBKR5_VBTBKR_Pos             (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR5_VBTBKR_Msk             (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* ========================================================  VBTBKR6  ======================================================== */
 #define R_SYSTEM_VBTBKR6_VBTBKR_Pos             (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR6_VBTBKR_Msk             (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* ========================================================  VBTBKR7  ======================================================== */
 #define R_SYSTEM_VBTBKR7_VBTBKR_Pos             (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR7_VBTBKR_Msk             (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* ========================================================  VBTBKR8  ======================================================== */
 #define R_SYSTEM_VBTBKR8_VBTBKR_Pos             (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR8_VBTBKR_Msk             (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* ========================================================  VBTBKR9  ======================================================== */
 #define R_SYSTEM_VBTBKR9_VBTBKR_Pos             (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR9_VBTBKR_Msk             (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR10  ======================================================== */
 #define R_SYSTEM_VBTBKR10_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR10_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR11  ======================================================== */
 #define R_SYSTEM_VBTBKR11_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR11_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR12  ======================================================== */
 #define R_SYSTEM_VBTBKR12_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR12_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR13  ======================================================== */
 #define R_SYSTEM_VBTBKR13_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR13_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR14  ======================================================== */
 #define R_SYSTEM_VBTBKR14_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR14_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR15  ======================================================== */
 #define R_SYSTEM_VBTBKR15_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR15_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR16  ======================================================== */
 #define R_SYSTEM_VBTBKR16_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR16_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR17  ======================================================== */
 #define R_SYSTEM_VBTBKR17_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR17_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR18  ======================================================== */
 #define R_SYSTEM_VBTBKR18_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR18_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR19  ======================================================== */
 #define R_SYSTEM_VBTBKR19_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR19_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR20  ======================================================== */
 #define R_SYSTEM_VBTBKR20_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR20_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR21  ======================================================== */
 #define R_SYSTEM_VBTBKR21_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR21_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR22  ======================================================== */
 #define R_SYSTEM_VBTBKR22_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR22_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR23  ======================================================== */
 #define R_SYSTEM_VBTBKR23_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR23_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR24  ======================================================== */
 #define R_SYSTEM_VBTBKR24_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR24_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR25  ======================================================== */
 #define R_SYSTEM_VBTBKR25_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR25_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR26  ======================================================== */
 #define R_SYSTEM_VBTBKR26_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR26_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR27  ======================================================== */
 #define R_SYSTEM_VBTBKR27_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR27_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR28  ======================================================== */
 #define R_SYSTEM_VBTBKR28_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR28_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR29  ======================================================== */
 #define R_SYSTEM_VBTBKR29_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR29_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR30  ======================================================== */
 #define R_SYSTEM_VBTBKR30_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR30_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR31  ======================================================== */
 #define R_SYSTEM_VBTBKR31_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR31_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR32  ======================================================== */
 #define R_SYSTEM_VBTBKR32_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR32_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR33  ======================================================== */
 #define R_SYSTEM_VBTBKR33_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR33_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR34  ======================================================== */
 #define R_SYSTEM_VBTBKR34_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR34_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR35  ======================================================== */
 #define R_SYSTEM_VBTBKR35_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR35_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR36  ======================================================== */
 #define R_SYSTEM_VBTBKR36_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR36_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR37  ======================================================== */
 #define R_SYSTEM_VBTBKR37_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR37_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR38  ======================================================== */
 #define R_SYSTEM_VBTBKR38_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR38_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR39  ======================================================== */
 #define R_SYSTEM_VBTBKR39_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR39_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR40  ======================================================== */
 #define R_SYSTEM_VBTBKR40_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR40_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR41  ======================================================== */
 #define R_SYSTEM_VBTBKR41_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR41_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR42  ======================================================== */
 #define R_SYSTEM_VBTBKR42_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR42_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR43  ======================================================== */
 #define R_SYSTEM_VBTBKR43_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR43_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR44  ======================================================== */
 #define R_SYSTEM_VBTBKR44_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR44_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR45  ======================================================== */
 #define R_SYSTEM_VBTBKR45_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR45_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR46  ======================================================== */
 #define R_SYSTEM_VBTBKR46_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR46_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR47  ======================================================== */
 #define R_SYSTEM_VBTBKR47_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR47_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR48  ======================================================== */
 #define R_SYSTEM_VBTBKR48_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR48_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR49  ======================================================== */
 #define R_SYSTEM_VBTBKR49_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR49_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR50  ======================================================== */
 #define R_SYSTEM_VBTBKR50_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR50_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR51  ======================================================== */
 #define R_SYSTEM_VBTBKR51_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR51_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR52  ======================================================== */
 #define R_SYSTEM_VBTBKR52_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR52_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR53  ======================================================== */
 #define R_SYSTEM_VBTBKR53_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR53_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR54  ======================================================== */
 #define R_SYSTEM_VBTBKR54_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR54_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR55  ======================================================== */
 #define R_SYSTEM_VBTBKR55_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR55_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR56  ======================================================== */
 #define R_SYSTEM_VBTBKR56_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR56_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR57  ======================================================== */
 #define R_SYSTEM_VBTBKR57_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
 #define R_SYSTEM_VBTBKR57_VBTBKR_Msk            (0xffUL)       /*!< VBTBKR (Bitfield-Mask: 0xff)                          */
/* =======================================================  VBTBKR58  ======================================================== */
 #define R_SYSTEM_VBTBKR58_VBTBKR_Pos            (0UL)          /*!< VBTBKR (Bit 0)                                        */
